{
    "player": {
        "name": "Jambra",
        "class": "Inquisidor da Cinza",
        "race": "Cinzéu",
        "level": 5,
        "xp": 0,
        "hp": 54,
        "max_hp": 54,
        "gold": 250,
        "attributes": {
            "int": 12,
            "cha": 12,
            "wis": 18,
            "dex": 10,
            "str": 16,
            "con": 14
        },
        "inventory": [
            "Malho de Inquisição: Um martelo de duas mãos, pesado e manchado de fuligem, com runas gravadas que brilham levemente perto de mentiras.",
            "Armadura de Placas da Legião Caída: Peças de aço batido, recuperadas de soldados mortos e marcadas com o símbolo sagrado da Cinza para purificá-las.",
            "Símbolo Sagrado de Ferro e Cinzas: Um medalhão de ferro bruto que contém as cinzas de um herege \"purificado\". É quente ao toque.",
            "Frasco com \"Pó de Sonho\": Uma pequena bolsa de couro contendo a droga local. Pode ser usada como isca, veneno ou para extrair informações de um viciado.",
            "Lanterna de Defunto: Uma lanterna a óleo cuja chama queima sem produzir fumaça, ideal para se mover sem ser detectado pela fumaça que paira na Fossa.",
            "Um dente de leite amarrado num cordão: Arrancado de um necromante amador no Beco dos Desdentados como um aviso."
        ],
        "equipment": {},
        "abilities": [
            "[Passiva] Fervor: Imune a efeitos de Medo. Causa +2 de dano de fogo.",
            "Julgamento das Brasas: Ao tocar as cinzas de uma fogueira ou corpo cremado, você recebe um vislumbre psíquico do evento mais carregado de emoção que ocorreu perto daquele fogo.",
            "Passos Silenciosos sobre a Fuligem: Você não produz som ao caminhar sobre cinzas, fuligem ou poeira, movendo-se como um fantasma nas ruínas e becos de Nova Arcádia."
        ]
    },
    "world": {
        "current_location": "Nova Arcádia",
        "time_of_day": "Amanhecer",
        "turn_count": 0,
        "danger_level": 5
    },
    "party": [],
    "enemies": [],
    "npcs": {},
    "inventory": [],
    "quests": [],
    "campaign_plan": {
        "location": "Catedral Afundada",
        "beats": [
            {
                "description": "Descreva o portão que separa a Fossa da Coroa ao amanhecer, com a fumaça dos barracos subindo em direção aos Jardins Suspensos.",
                "status": "done"
            },
            {
                "description": "Um viciado em 'Pó de Sonho', com a boca sangrando, tenta vender um dente recém-arrancado ao Inquisidor, balbuciando sobre 'o preço do sussurro' no Beco dos Desdentados.",
                "status": "pending"
            },
            {
                "description": "O rastro de viciados e sangue leva a um símbolo arcano amador, pintado na entrada da Catedral Afundada, pulsando com uma energia profana fraca.",
                "status": "pending"
            }
        ],
        "climax": "Confrontar um necromante amador que usa os dentes para animar um golem de lama, acreditando que a abominação protegerá os doentes da Catedral.",
        "current_step": 1,
        "last_planned_turn": 0
    },
    "message_history": [
        {
            "type": "system",
            "content": "A jornada de Jambra começa em Nova Arcádia."
        },
        {
            "type": "human",
            "content": "Descreva o cenário ao meu redor. Sou um Inquisidor da Cinza de nível 5."
        },
        {
            "type": "ai",
            "content": "O amanhecer em Nova Arcádia é menos um espetáculo de luz e mais uma confirmação sombria da divisão social. Você está no topo da rampa de acesso ao **Portão da Divisão**, uma muralha colossal de ferro enferrujado e concreto que separa o caos absoluto da Fossa da ordem frágil da Coroa. A névoa matinal não é natural; é a fumaça espessa e gordurosa de milhares de barracos improvisados, um cheiro agridoce de queima e esgoto que paira como um sudário sobre a cidade baixa.\n\nAbaixo, a **Fossa** se estende como um oceano de lama e telhados de lata, um labirinto onde a Legião raramente se aventura. Seu olhar, no entanto, é atraído para cima. A fumaça da miséria não se dispersa; ela é canalizada por correntes de ar mágicas em direção aos **Jardins Suspensos da Ilusão**. Você sabe que, neste momento, os nobres da Coroa estão desfrutando de suas bebidas matinais, observando a fumaça da favela como uma paisagem exótica e macabra, enquanto as flores artificiais, mantidas por magia, florescem em desafio ao sol.\n\nSua missão como Inquisidor da Cinza começa neste limiar. O Portão da Divisão está fechado, monitorado por um pequeno destacamento de guardas da Legião, cujas armaduras polidas contrastam brutalmente com a sujeira ao redor. Você está na fronteira, e cada passo tem consequências.\n\nO que você faz?\n\n1.  Aproximar-se do **Portão da Divisão** e tentar usar sua autoridade de Inquisidor para entrar na Fossa.\n2.  Ignorar o portão principal e procurar uma passagem lateral ou um beco que leve diretamente para os barracos da **Fossa**.\n3.  Dirigir-se à área mais segura da muralha, procurando um oficial da **Legião** para obter informações sobre a segurança da Coroa."
        }
    ]
}